In [1]:
import re
import os

In [76]:
import csv

In [2]:
import pandas as pd

In [3]:
import sys
import subprocess

In [8]:
def translate(word):
    result = subprocess.run(
    ["trans", ":ja", f"'{word}'"], capture_output=True, text=True
    ).stdout
    translation = re.findall(
        '\「(.*?)\」', result
    )
    return translation[-1]

In [96]:
ROOT_DIR = os.path.dirname(os.path.abspath("../README.md"))
DATA_DIR = os.path.join(ROOT_DIR, "data/linkedin")

In [97]:
df = pd.read_excel(f"{DATA_DIR}/okielectriccable-2020-10_visitors.xls", sheet_name=[1])

In [98]:
test = "Kitchener, Canada Area"

In [99]:
df[1]

                      Location  Total views
0          Greater Boston Area            2
1         Greater Chicago Area            5
2          Houston, Texas Area            2
3       Greater Milwaukee Area            2
4         Greater Seattle Area            6
5       Kitchener, Canada Area            3
6             Perth, Australia            1
7            Milan Area, Italy            2
8        Bengaluru Area, India            5
9           Kalyan Area, India            3
10       New Delhi Area, India            2
11            Pune Area, India            2
12     Rest of Zhejiang, China            6
13  Bogotá D.C. Area, Colombia            4

In [100]:
countries = pd.read_csv(f"{DATA_DIR}/../countries.txt", sep="\n", header=None)
countries.columns = ["Country"]

In [101]:
cities = pd.read_csv(f"{DATA_DIR}/../cities.txt", sep="\n", header=None)
cities.columns = ["City"]

In [102]:
test = df[1].iloc[1]['Location']

In [103]:
test = re.split(',| ', test)

In [104]:
test

['Greater', 'Chicago', 'Area']

In [105]:
[i for i in test if i in countries['Country'].values]

[]

In [119]:
[i for i in test if i in cities['City'].values]

['Chicago']

In [129]:
def get_country(location):
    country = [i for i in re.split(',| ', location) if i in countries['Country'].values]
    if country:
        return country[0]
    elif [i for i in re.split(',| ', location) if i in cities['City'].values]:
        return "United States"
    else:
        print(f"Unable to locate: {location}")
        return input("What country is this?\n> ")

In [132]:
df[1]['Location'] = df[1]['Location'].apply(lambda x: get_country(x))

In [133]:
df[1]

         Location  Total views
0   United States            2
1   United States            5
2   United States            2
3   United States            2
4   United States            6
5          Canada            3
6       Australia            1
7           Italy            2
8           India            5
9           India            3
10          India            2
11          India            2
12          China            6
13       Colombia            4

In [136]:
import numpy as np
df[1].groupby("Location").agg(np.sum).sort_values(by="Total views", ascending=False).reset_index()

        Location  Total views
0  United States           17
1          India           12
2          China            6
3       Colombia            4
4         Canada            3
5          Italy            2
6      Australia            1

In [135]:
df[1]

         Location  Total views
0   United States            2
1   United States            5
2   United States            2
3   United States            2
4   United States            6
5          Canada            3
6       Australia            1
7           Italy            2
8           India            5
9           India            3
10          India            2
11          India            2
12          China            6
13       Colombia            4